// 题目：企业发放的奖金根据利润提成。

// 利润(I)低于或等于1万元时，奖金可提10%；
// 利润高于1万元，低于2万元时，低于1万元的部分按10%提成，
// 高于1万元的部分，可提成7.5%；
// 2万到4万之间时，高于2万元的部分，可提成5%；
// 4万到6万之间时高于4万元的部分，可提成3%；
// 6万到10万之间时，高于6万元的部分，可提成1.5%；
// 高于10万元时，超过10万元的部分按1%提成。
// 从键盘输入当月利润I，求应发放奖金总数？
#include<stdio.h>
int main()
{
    double n;//利润
    double sum;
    double sum1 = 10000 * 0.1;
    double sum2 = sum1 + 10000 * 0.075;
    double sum3 = sum2 + 20000 * 0.05;
    double sum4 = sum3 + 20000 * 0.03;
    double sum5 = sum4 + 40000 * 0.015;
    scanf("%lf",&n);
    if(n<10000)
    {
        sum =  n * 0.1;
    }else if(n<=20000)
    {
        sum = sum1 + (n-10000) * 0.075;
    }else if(n<=40000)
    {
        sum = sum2 + (n-30000) * 0.05;
    }else if(n<=60000)
    {
        sum = sum3 + (n-40000) * 0.03;
    }else if(n<=100000)
    {
        sum = sum4 + (n-60000) * 0.015;
    }else if(n>100000)
    {
        sum = sum5 + (n-100000) * 0.01;
    }

    printf("%f\n",sum);
}